workspace/InformationRegisters/АукРасчетИтоговПеременные.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>АукРасчетИтоговПеременные</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТипПеременной</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.АукЭлементыДанныхАукционов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеПеременной</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.АукЭлементыДанныхАукционов</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗаписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Аукцион</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АукАукционы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерЭтапа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Участник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АукУчастникиАукционов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтрокаДанных</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Переменная</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

workspace/InformationRegisters/АукРасчетИтоговПеременные/Ext/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

Процедура ДобавитьЗаписи(пМассивСтруктур) Экспорт
	
	сткРез = АукОбщийСервер.ДобавитьЗаписиВРегистрСведений(пМассивСтруктур, "АукРасчетИтоговПеременные"); 
	
	Если Не сткРез.Успех Тогда	
		ВызватьИсключение сткРез.Ошибка;		
	КонецЕсли;
	
КонецПроцедуры

Функция ПодготовитьДанныеДляЗаписи(пСткПараметры) Экспорт
	масРезультат = Новый Массив;
	
	Для Каждого сткДанныеПеременной Из пСткПараметры.ПеременныеФормулы Цикл
		Для Каждого сткЗначениеПеременной Из сткДанныеПеременной.Переменные Цикл	
			сткЗапись = Новый Структура;
			
			сткЗапись.Вставить("Аукцион",		пСткПараметры.Аукцион);
			сткЗапись.Вставить("НомерЭтапа",	пСткПараметры.НомерЭтапа);
			
			сткЗапись.Вставить("Участник",		сткДанныеПеременной.Участник);
			сткЗапись.Вставить("СтрокаДанных",	сткДанныеПеременной.СтрокаДанных);
			
			сткЗапись.Вставить("Переменная",			сткЗначениеПеременной.Переменная);
			сткЗапись.Вставить("ТипПеременной",			сткЗначениеПеременной.ТипПеременной);
			сткЗапись.Вставить("ЗначениеПеременной",	сткЗначениеПеременной.ЗначениеПеременной);
			
			сткЗапись.Вставить("Автор",			пСткПараметры.Автор);
			сткЗапись.Вставить("ДатаЗаписи",	пСткПараметры.ТекДата);
			
			масРезультат.Добавить(сткЗапись);	
		КонецЦикла;	
	КонецЦикла;	
	
	Возврат масРезультат;
КонецФункции

Функция СохраненныеЗначенияПеременныхРасчетаИтоговАукционаПоЭтапу(пАукцион, пНомерЭтапа, пНастройкаРасчета) Экспорт	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	АукРасчетИтоговПеременные.Участник КАК Участник,
	|	АукРасчетИтоговПеременные.СтрокаДанных КАК СтрокаДанных,
	|	АукРасчетИтоговПеременные.Переменная КАК Переменная,
	|	АукРасчетИтоговПеременные.ТипПеременной КАК ТипПеременной,
	|	АукРасчетИтоговПеременные.ЗначениеПеременной КАК ЗначениеПеременной
	|ИЗ
	|	РегистрСведений.АукРасчетИтоговПеременные КАК АукРасчетИтоговПеременные
	|ГДЕ
	|	АукРасчетИтоговПеременные.Аукцион = &Аукцион
	|	И АукРасчетИтоговПеременные.НомерЭтапа = &НомерЭтапа
	|ИТОГИ ПО
	|	Участник,
	|	СтрокаДанных";
	
	Запрос.УстановитьПараметр("Аукцион",	пАукцион);
	Запрос.УстановитьПараметр("НомерЭтапа",	пНомерЭтапа);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	Иначе	
		тзРезультат = СохраненныеЗначенияПеременныхРасчетаИтоговАукционаПоЭтапу_Таблица();
		
		СохраненныеЗначенияПеременныхРасчетаИтоговАукционаПоЭтапу_ЗаполнитьДанныеРекурсивно(тзРезультат, РезультатЗапроса);
		
		Возврат тзРезультат;
	КонецЕсли;
КонецФункции	

#КонецОбласти

#Область СлужебныеПроцедурыИФункции 

Процедура СохраненныеЗначенияПеременныхРасчетаИтоговАукционаПоЭтапу_ЗаполнитьДанныеРекурсивно(пТзРезультат, пРезультатЗапроса)
	ВыборкаУчастник = пРезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаУчастник.Следующий() Цикл
		
		ВыборкаСтрокаДанных = ВыборкаУчастник.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаСтрокаДанных.Следующий() Цикл
			
			ВыборкаДетальная = ВыборкаСтрокаДанных.Выбрать();
			
			Пока ВыборкаДетальная.Следующий() Цикл
				ЗаполнитьЗначенияСвойств(пТзРезультат.Добавить(), ВыборкаДетальная);	
			КонецЦикла;	
		КонецЦикла;	
	КонецЦикла;
КонецПроцедуры	

Функция СохраненныеЗначенияПеременныхРасчетаИтоговАукционаПоЭтапу_Таблица()
	тзРезультат = Новый ТаблицаЗначений;
	
	тзРезультат.Колонки.Добавить("Участник",			Новый ОписаниеТипов("СправочникСсылка.АукУчастникиАукционов"));
	тзРезультат.Колонки.Добавить("СтрокаДанных",		Новый ОписаниеТипов("Число"));
	тзРезультат.Колонки.Добавить("Переменная",			Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(256)));
	тзРезультат.Колонки.Добавить("ТипПеременной",		Новый ОписаниеТипов("ПланВидовХарактеристикСсылка.АукЭлементыДанныхАукционов"));
	тзРезультат.Колонки.Добавить("ЗначениеПеременной",	Метаданные.ПланыВидовХарактеристик.АукЭлементыДанныхАукционов.Тип);
	
	Возврат тзРезультат;
КонецФункции	

#КонецОбласти
